// Lab_03_1
// Лукашевич Андрій
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 12

const x  = +prompt('x = '); // Запрошуємо ввід значення вхідного параметру

let y; // результат обчислення виразу
let A; // проміжний результат - функціонально стала частина виразу
let B; // проміжний результат - функціонально змінна частина виразу

A = (2 + x) / (x * x) + 1;

// спосіб 1: розгалуження в скороченій формі

if (x < 0) {
  B = x ** 3 - 2 * x ** 4;
}

if (0 <= x && x <= 2) {
  B = (Math.abs(x) + Math.E ** x) ** 3;
}

if (x > 2) {
  B = 4 * Math.cos(x ** 2 - 2);
}

y = A + B;

console.log(y);

// спосіб 2: розгалуження в повній формі

if (x < 0) {
  B = x ** 3 - 2 * x ** 4;
} else if (0 <= x && x <= 2) {
  B = (Math.abs(x) + Math.E ** x) ** 3;
} else {
  B = 4 * Math.cos(x ** 2 - 2);
}

y = A + B;

console.log(y);
