// Lab_03_2
// Лукашевич Андрій
// Лабораторна робота № 3.2
// Розгалуження, задане формулою: функція з параметрами
// Варіант 12

const x = +prompt('x = '); // Запрошуємо ввід значення вхідного параметру х
const a = +prompt('a = '); // Запрошуємо ввід значення вхідного параметру a
const b = +prompt('b = '); // Запрошуємо ввід значення вхідного параметру b
const c = +prompt('c = '); // Запрошуємо ввід значення вхідного параметру c

let F; // результат обчислення виразу;

// спосіб 1: розгалуження в скороченій формі

if (x < 0.6 && (b + c) !== 0) {
  F = a * x ** 2 + b ** 2 + c;
}

if (x > 0.6 && (b + c) === 0) {
  F = (x - a) / (x - c);
}

if (!(x < 0.6 && (b + c) !== 0) && !(x > 0.6 && (b + c) === 0)) {
  F = x / c + x / a;
}

console.log(F);

// спосіб 2: розгалуження в повній формі

if (x < 0.6 && (b + c) !== 0) {
  F = a * x ** 2 + b ** 2 + c;
} else if (x > 0.6 && (b + c) === 0) {
  F = (x - a) / (x - c);
} else {
  F = x / c + x / a;
}

console.log(F);
